
#Область ПрограммныйИнтерфейс

Функция ДокументВСтроку(ДокументСсылка) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("ДокументВСтроку", "ДокументСсылка", ДокументСсылка, Документы.ТипВсеСсылки());
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		ВызватьИсключение нСтр("ru='Ссылка на документ не указана. Сериализация не может быть выполнена'", "ru") 
	КонецЕсли; 
	
	МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипЗнч(ДокументСсылка));
	
	//ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	
	ДокументСериализация = СтрШаблон("%1<%2>", Разделитель("Д"), МетаданныеДокумента.ПолноеИмя());
	
	НеВыгружатьРеквизиты = СтрРазделить("Ссылка,Номер", ",", Ложь);
	Для Каждого СтРеквизит Из МетаданныеДокумента.СтандартныеРеквизиты Цикл
		Если НеВыгружатьРеквизиты.Найти(СтРеквизит.Имя) <> Неопределено Тогда Продолжить КонецЕсли;
		РеквизитОбъектаВСтроку(СтРеквизит.Имя, ДокументСсылка);
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеДокумента.Реквизиты Цикл
		РеквизитОбъектаВСтроку(Реквизит.Имя, ДокументСсылка);
	КонецЦикла; 
	
	Для Каждого ТабличнаяЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл 
		Если ДокументСсылка[ТабличнаяЧасть.Имя].Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Отступ = Отступ + 1;
		ДополнитьРезультатСериализации(Разделитель("Т") + ТабличнаяЧасть.Имя + "[", Истина);
		Для Каждого СтрокаТЧ Из ДокументСсылка[ТабличнаяЧасть.Имя] Цикл
			ДополнитьРезультатСериализации(Разделитель("С"), Истина);
			Для Каждого РеквизитТЧ Из ТабличнаяЧасть.Реквизиты Цикл
				РеквизитОбъектаВСтроку(РеквизитТЧ.Имя, СтрокаТЧ);
			КонецЦикла;
			ДополнитьРезультатСериализации(Разделитель("С", 1));
		КонецЦикла; 
		ДополнитьРезультатСериализации("]" + Разделитель("Т", 1));
		Отступ = Отступ - 1;
	КонецЦикла;
	
	ДополнитьРезультатСериализации(Разделитель("Д", 1));
	
	Возврат ДокументСериализация;
	
КонецФункции

Функция ДокументИзСтроки(ИсходнаяСтрока) Экспорт
	
	ДокументСериализация = ИсходнаяСтрока;
	
	Если Не СледующаяСтруктураСтрокОбъекта("Д") Тогда
		ОбщегоНазначения.СообщитьПользователю(нСтр("ru='Не найдено описание документа'", "ru"));
	КонецЕсли; 
	
	МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(СтруктураСтрокОбъекта.ТипСтрокой);
	ДокументМенеджер = Документы[МетаданныеДокумента.Имя];
	ДокументОбъект = ДокументМенеджер.СоздатьДокумент();
	
	НеЗагружатьРеквизиты = СтрРазделить("Номер,Ссылка", ",", Ложь);
	
	Пока СледующаяСтруктураСтрокОбъекта("Р") Цикл
		
		ИмяРеквизита = СтруктураСтрокОбъекта.Имя;
		Если НеЗагружатьРеквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда Продолжить КонецЕсли;
		
		// Распарсить реквизит
		ЗначениеРеквизита = ЗначениеРеквизитаОбъектаИзСтруктурыСтрок();
		Если ЗначениеРеквизита = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(нСтр("ru='Реквизит ""%1"" не будет загружен'", "ru"), ИмяРеквизита)); 
		КонецЕсли;
		ДокументОбъект[ИмяРеквизита] = ЗначениеРеквизита;
		
	КонецЦикла;
	
	Пока СледующаяСтруктураСтрокОбъекта("Т") Цикл
		
		ИмяТаблицы = СтруктураСтрокОбъекта.Имя;
		// Распарсить таблицу
		Пока СледующаяСтруктураСтрокОбъекта("С") Цикл
			СтрокаТаблицы = ДокументОбъект[ИмяТаблицы].Добавить();
			Пока СледующаяСтруктураСтрокОбъекта("Р") Цикл
				ЗначениеРеквизита = ЗначениеРеквизитаОбъектаИзСтруктурыСтрок();
				Если ЗначениеРеквизита = Неопределено Тогда
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон(нСтр("ru='Реквизит ""%1"" строки %2 табличной части ""%3"" не будет загружен'", "ru"),
														  СтруктураСтрокОбъекта.Имя,
														  СтрокаТаблицы.НомерСтроки,
														  ИмяТаблицы)); 
				КонецЕсли;
				СтрокаТаблицы[СтруктураСтрокОбъекта.Имя] = ЗначениеРеквизита;
			КонецЦикла; 
		КонецЦикла; 
		
	КонецЦикла;
	
	Попытка
		Попытка
			ДокументОбъект.Записать(?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(нСтр("ru='Не удалось записать документ по причине:
																 | %1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
	КонецПопытки; 
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции

#КонецОбласти 

#Область Выгрузка

Процедура ДополнитьРезультатСериализации(ДобавляемаяСтрока, СНовойСтроки = Ложь)
	
	СтрокаОтступа = "";
	Если СНовойСтроки Тогда
		Табуляция = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(Символы.Таб, Отступ);
		СтрокаОтступа = Символы.ПС + Табуляция;
	КонецЕсли; 
	ДокументСериализация = ДокументСериализация + СтрокаОтступа + ДобавляемаяСтрока;
	
КонецПроцедуры 

Процедура РеквизитОбъектаВСтроку(ИмяРеквизита, Объект)
	
	Значение = Объект[ИмяРеквизита];
	Тип = ТипЗнч(Значение);
	
	ЭтоСсылка = ОбщегоНазначения.ЭтоСсылка(Тип);
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		//ДобавитьПредставленияРеквизита(Строка, Реквизит.Имя, ПредставлениеТипа, ПредставлениеЗначения, Отступ);
		Возврат;
	КонецЕсли;
	
	Отступ = Отступ + 1;
	ПредставлениеТипа = "";
	
	Если ЭтоСсылка Тогда
		МетаданныеРеквизита = Метаданные.НайтиПоТипу(Тип);
		ПредставлениеТипа = ИмяТипаСсылки(МетаданныеРеквизита.ПолноеИмя());
	Иначе
		ПредставлениеТипа = Строка(Тип);
	КонецЕсли;
	
	Если ПустаяСтрока(ПредставлениеТипа) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(нСтр("ru='Не найдено представление для типа %1'"), Тип));
	КонецЕсли;
	
	ДополнитьРезультатСериализации(Разделитель("Р") + СтрШаблон("%1<%2>", ИмяРеквизита, ПредставлениеТипа), Истина); 
	
	Если Не ЭтоСсылка Тогда
		Если Тип = Тип("ХранилищеЗначения") Тогда
			ПредставлениеТипа = "ХранилищеЗначения";
			ПотокЗаписи = Новый ПотокВПамяти;
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьДанных = Новый ЗаписьДанных(ПотокЗаписи, КодировкаТекста.UTF8);
			ЗаписьXML.ОткрытьПоток(ПотокЗаписи, КодировкаТекста.UTF8);
			ЗаписатьXML(ЗаписьXML, Значение);
			ЗаписьXML.Закрыть();
			ДвоичныеДанные = ПотокЗаписи.ЗакрытьИПолучитьДвоичныеДанные();
			ПредставлениеЗначения = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные, КодировкаТекста.UTF8);
		ИначеЕсли Тип = Тип("Строка") Тогда 
			ПредставлениеЗначения = Значение;
		Иначе
			ПредставлениеЗначения = Формат(Значение);
		КонецЕсли;
		
		ДополнитьРезультатСериализации(ПредставлениеЗначения);
	Иначе
		
		Если ОбщегоНазначения.ЭтоДокумент(МетаданныеРеквизита) Тогда
			
			РеквизитОбъектаВСтроку("Номер", Значение);
			РеквизитОбъектаВСтроку("Дата", Значение);
			
		ИначеЕсли ОбщегоНазначения.ЭтоСправочник(МетаданныеРеквизита)
			Или ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеРеквизита) 
			Или ОбщегоНазначения.ЭтоПланСчетов(МетаданныеРеквизита)
			Или ОбщегоНазначения.ЭтоПланВидовРасчета(МетаданныеРеквизита) Тогда
			
			РеквизитОбъектаВСтроку("Код", Значение);
			РеквизитОбъектаВСтроку("Наименование", Значение);
			
		ИначеЕсли ОбщегоНазначения.ЭтоПеречисление(МетаданныеРеквизита) Тогда
			
			ПеречислениеМенеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеРеквизита.ПолноеИмя());
			ИндексЗначения = ПеречислениеМенеджер.Индекс(Значение);
			ДополнитьРезультатСериализации(МетаданныеРеквизита.ЗначенияПеречисления[ИндексЗначения].Имя);
			
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(нСтр("ru='Непредусмотренный тип ""%1"". Значение: ""%2""'"), Тип, Значение));
		КонецЕсли;
		
	КонецЕсли;
	ДополнитьРезультатСериализации(Разделитель("Р", 1));
	
	Отступ = Отступ - 1;
	
КонецПроцедуры

#КонецОбласти 

#Область Загрузка

Функция СледующаяСтруктураСтрокОбъекта(КодОбъекта)
	
	СтруктураСтрокОбъекта = СтруктураСтрокОбъекта();
	
	ТекПредставление = ДанныеПредставленийОбъектов[ДанныеПредставленийОбъектов.Количество() - 1];
	Префикс = Лев(ДокументСериализация, ТекПредставление.КонецДанных); 
	
	НачалоОбъекта = СтрНайти(Префикс, Разделитель(КодОбъекта), , Итератор) + СтрДлина(Разделитель(КодОбъекта));
	Если НачалоОбъекта <= ТекПредставление.КонецДанных + СтрДлина(Разделитель(КодОбъекта)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтекОбъектов = 1;
	Позиция = НачалоОбъекта + 1; 
	Пока СтекОбъектов > 0 И Позиция < СтрДлина(Префикс) Цикл
		СледОткрывающий = СтрНайти(Префикс, Разделитель(КодОбъекта), , Позиция);
		Если СледОткрывающий = 0 Тогда СледОткрывающий = СтрДлина(Префикс) КонецЕсли; 
		СледЗакрывающий = СтрНайти(Префикс, Разделитель(КодОбъекта, 1), , Позиция);
		Если СледЗакрывающий = 0 Тогда СледЗакрывающий = СтрДлина(Префикс) КонецЕсли; 
		
		Если СледОткрывающий < СледЗакрывающий Тогда
			СтекОбъектов = СтекОбъектов + 1;
		ИначеЕсли СледОткрывающий > СледЗакрывающий Тогда 
			СтекОбъектов = СтекОбъектов - 1;
		Иначе
			ВызватьИсключение СтрШаблон("Ожидается закрывающий разделитель (%1)", Разделитель(КодОбъекта, 1));
		КонецЕсли; 
		
		Позиция = Мин(СледОткрывающий, СледЗакрывающий) + 1;
	КонецЦикла;
	
	Если СтекОбъектов <> 0 Тогда
		ВызватьИсключение СтрШаблон("Ожидается закрывающий разделитель (%1)", Разделитель(КодОбъекта, 1));
	КонецЕсли;
	КонецОбъекта = СледЗакрывающий;
	
	ПредставлениеОбъекта = ДанныеПредставленийОбъектов.Добавить();
	ПредставлениеОбъекта.КодОбъекта = КодОбъекта;
	ПредставлениеОбъекта.НачалоДанных = НачалоОбъекта;
	ПредставлениеОбъекта.КонецДанных = КонецОбъекта;
	
	ДанныеОбъектаСтрокой = Сред(Префикс, НачалоОбъекта, КонецОбъекта - НачалоОбъекта);
	
	//Сообщить(ДанныеОбъектаСтрокой);
	
	Если КодОбъекта = "С" Тогда
		СтруктураСтрокОбъекта.ДанныеСтрокой = СокрЛП(ДанныеОбъектаСтрокой);
	ИначеЕсли КодОбъекта = "Т" Тогда
		НачалоМассива = СтрНайти(ДанныеОбъектаСтрокой, "[");
		КонецМассива = СтрНайти(ДанныеОбъектаСтрокой, "]", НаправлениеПоиска.СКонца);
		СтруктураСтрокОбъекта.Имя = СокрЛП(Лев(ДанныеОбъектаСтрокой, НачалоМассива - 1));
		СтруктураСтрокОбъекта.ДанныеСтрокой = СокрЛП(Сред(ДанныеОбъектаСтрокой, НачалоМассива + 1, КонецМассива - НачалоМассива - 1));
	ИначеЕсли КодОбъекта = "Д" Или КодОбъекта = "Р" Тогда
		НачалоТипа = СтрНайти(ДанныеОбъектаСтрокой, "<");
		КонецТипа = СтрНайти(ДанныеОбъектаСтрокой, ">");
		СтруктураСтрокОбъекта.Имя = СокрЛП(Лев(ДанныеОбъектаСтрокой, НачалоТипа - 1));
		СтруктураСтрокОбъекта.ТипСтрокой = СокрЛП(Сред(ДанныеОбъектаСтрокой, НачалоТипа + 1, КонецТипа - НачалоТипа - 1));
		СтруктураСтрокОбъекта.ДанныеСтрокой = СокрЛП(Прав(ДанныеОбъектаСтрокой, СтрДлина(ДанныеОбъектаСтрокой) - КонецТипа));
	Иначе
		ВызватьИсключение СтрШаблон("Не распознан код объекта (%1)", КодОбъекта);
	КонецЕсли;
	
	Итератор = НачалоОбъекта + 1;
	
	Возврат Истина;
	
КонецФункции 

Функция ЗначениеРеквизитаОбъектаИзСтруктурыСтрок()
	
	ТипЗначения = Тип(СтруктураСтрокОбъекта.ТипСтрокой);
	ЗначениеСтрокой = СтруктураСтрокОбъекта.ДанныеСтрокой;
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗначения) Тогда
		МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗначения);
		МенеджерЗначения = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеЗначения.ПолноеИмя());
		
		Если ОбщегоНазначения.ЭтоДокумент(МетаданныеЗначения) Тогда
			
			РеквизитыПоиска = Новый Структура("Номер, Дата");
			Пока СледующаяСтруктураСтрокОбъекта("Р") Цикл
				Если СтруктураСтрокОбъекта.Имя = "Номер" Тогда
					Если СтруктураСтрокОбъекта.ТипСтрокой = "Число" Тогда
						РеквизитыПоиска.Номер = Число(СтруктураСтрокОбъекта.ДанныеСтрокой);
					ИначеЕсли СтруктураСтрокОбъекта.ТипСтрокой = "Строка" Тогда
						РеквизитыПоиска.Номер = СтруктураСтрокОбъекта.ДанныеСтрокой;
					КонецЕсли;
				ИначеЕсли СтруктураСтрокОбъекта.Имя = "Дата" Тогда 
					РеквизитыПоиска.Дата = Дата(СтруктураСтрокОбъекта.ДанныеСтрокой);
				КонецЕсли; 
			КонецЦикла;
			Если МетаданныеЗначения.ДлинаНомера > 0 Тогда
				Возврат МенеджерЗначения.НайтиПоНомеру(РеквизитыПоиска.Номер, РеквизитыПоиска.Дата);
			Иначе
				Возврат МенеджерЗначения.НайтиПоРеквизиту("Дата", РеквизитыПоиска.Дата);
			КонецЕсли; 
			
		ИначеЕсли ОбщегоНазначения.ЭтоСправочник(МетаданныеЗначения)
			Или ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеЗначения) 
			Или ОбщегоНазначения.ЭтоПланСчетов(МетаданныеЗначения)
			Или ОбщегоНазначения.ЭтоПланВидовРасчета(МетаданныеЗначения) Тогда
			
			РеквизитыПоиска = Новый Структура("Код, Наименование");
			Пока СледующаяСтруктураСтрокОбъекта("Р") Цикл
				Если СтруктураСтрокОбъекта.Имя = "Код" Тогда
					Если СтруктураСтрокОбъекта.ТипСтрокой = "Число" Тогда
						РеквизитыПоиска.Код = Число(СтруктураСтрокОбъекта.ДанныеСтрокой);
					ИначеЕсли СтруктураСтрокОбъекта.ТипСтрокой = "Строка" Тогда
						РеквизитыПоиска.Код = СтруктураСтрокОбъекта.ДанныеСтрокой;
					КонецЕсли;
				ИначеЕсли СтруктураСтрокОбъекта.Имя = "Наименование" Тогда 
					РеквизитыПоиска.Наименование = СтруктураСтрокОбъекта.ДанныеСтрокой;
				КонецЕсли; 
			КонецЦикла;
			Если МетаданныеЗначения.ДлинаКода > 0 Тогда
				Возврат МенеджерЗначения.НайтиПоКоду(РеквизитыПоиска.Код);
			ИначеЕсли МетаданныеЗначения.ДлинаНаименования > 0 Тогда 
				Возврат МенеджерЗначения.НайтиПоНаименованию(РеквизитыПоиска.Наименование, Истина);
			Иначе
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(нСтр("ru='Ссылка типа ""%1"" не может быть найдена по стандартным реквизитам", "ru"), ТипЗначения));
				Возврат Неопределено;
			КонецЕсли; 
			
		ИначеЕсли ОбщегоНазначения.ЭтоПеречисление(МетаданныеЗначения) Тогда
			
			Возврат МенеджерЗначения[ЗначениеСтрокой];
			
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(нСтр("ru='Ссылочный тип ""%1"" не поддерживается", "ru"), ТипЗначения));
			Возврат Неопределено;
		КонецЕсли;
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда 
		Возврат ЗначениеСтрокой;
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Возврат Число(ЗначениеСтрокой);
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Возврат Булево(ЗначениеСтрокой);
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Возврат Дата(ЗначениеСтрокой);
	ИначеЕсли ТипЗначения = Тип("ХранилищеЗначения") Тогда
		ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(ЗначениеСтрокой, КодировкаТекста.UTF8);
		ПотокЧтения = Новый ПотокВПамяти(ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанные));
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьПоток(ПотокЧтения);
		Значение = ПрочитатьXML(ЧтениеXML, Тип("ХранилищеЗначения"));
		ЧтениеXML.Закрыть();
		ПотокЧтения.Закрыть();
		Возврат Значение;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(нСтр("ru='Тип ""%1"" не найден", "ru"), ТипЗначения));
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции

#КонецОбласти

#Область СлужебныепроцедурыИФункции

Функция СтруктураСтрокОбъекта()
	
	Возврат Новый Структура("Имя, ТипСтрокой, ДанныеСтрокой");
	
КонецФункции 

Функция ИмяЕстьВКоллекцииОбъектовМетаданных(Знач Имя, КоллекцияОбъектовМетаданных)
	
	Для Каждого ОбъектМетаданных Из КоллекцияОбъектовМетаданных Цикл
		Если ОбъектМетаданных.Имя = Имя Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Ложь;
	
КонецФункции 

Функция ИмяТипаСсылки(ПолноеИмя)
	
	Массив = СтрРазделить(ПолноеИмя, ".", Ложь);
	Возврат Массив[0] + "Ссылка." + ?(Массив.Количество() > 1, Массив[1],"") 
	
КонецФункции

Функция Разделитель(Назначение, Закрывающий = 0)
	
	Если Назначение = "Д" Тогда //Документ
		ПредставлениеНазначения = "doc";
	ИначеЕсли Назначение = "Р" Тогда //Реквизит
		ПредставлениеНазначения = "attr";
	ИначеЕсли Назначение = "Т" Тогда //Табличная часть
		ПредставлениеНазначения = "table";
	ИначеЕсли Назначение = "С" Тогда //Строка табличной части
		ПредставлениеНазначения = "tuple";
	Иначе
		ВызватьИсключение СтрШаблон("Непредвиденное назначение разделителя (%1)", Назначение);
	КонецЕсли; 
		
	Возврат СтрШаблон("<%1%2>", ?(Закрывающий, "/", ""), ПредставлениеНазначения);
	
КонецФункции 

#КонецОбласти 

#Область Инициализация

Итератор = 1;
Отступ = 0;

#КонецОбласти 
